# Taps
tap "bufbuild/buf"
tap "tilt-dev/tap"

# Core tools
brew "curl"
brew "git"
brew "ripgrep"
brew "fzf"
brew "eza"
brew "starship"

# Shell & terminal
brew "zsh"
brew "atuin"

# Kubernetes
brew "kubectl"
brew "kustomize"
brew "kind"
brew "kompose"
brew "k9s"
brew "socat"
brew "tilt"
brew "tilt-dev/tap/ctlptl"

# Go development
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "goose"

# Protobuf / gRPC
brew "bufbuild/buf/buf"
brew "grpcurl"

# Cloud & storage
brew "s3cmd"
brew "b2-tools"

# CI/CD
brew "act"

# AI coding tools
cask "claude-code"
cask "codex"
